# üìà Merge, Join ve Concatenate

In [133]:
import numpy as np
import pandas as pd

### ‚úÖ**`Concatenation - Birle≈ütirme`**

Pandas'ta ``"pd.concat"``, birden fazla DataFrame veya Series'i belirli bir eksen boyunca birle≈ütirmek i√ßin kullanƒ±lƒ±r. Bu fonksiyon, birle≈ütirme sƒ±rasƒ±nda esneklik ve kontrol saƒülar.

‚û°Ô∏è``pd.concat`` genellikle ≈üu durumlarda kullanƒ±lƒ±r:

Verileri dikey (satƒ±r bazƒ±nda) veya yatay (s√ºtun bazƒ±nda) birle≈ütirmek.
Aynƒ± veya farklƒ± s√ºtun adlarƒ±na sahip DataFrame'leri birle≈ütirmek.
Eksik veri y√∂netimi ve indeksleme i≈ülemleri yapmak.

‚è©"**Temel S√∂z Dizimi:**"

```python
pd.concat(objs, axis=0, join='outer', ignore_index=False, keys=None, ...)
```

"**Parametreler:**"

``objs:`` Birle≈ütirilecek DataFrame veya Series'lerin listesi.(df1,df2...)

``axis:`` Birle≈ütirme ekseni.(satƒ±r veya s√ºtun( 0 - 1))

``axis=0:`` Satƒ±r bazƒ±nda birle≈ütirme (dikey).

``axis=1:`` S√ºtun bazƒ±nda birle≈ütirme (yatay).

``join:`` Birle≈ütirme y√∂ntemi.

``outer:`` Varsayƒ±lan, t√ºm indeksleri i√ßerir.

``inner:`` Ortak indeksleri i√ßerir.

``ignore_index:`` ƒ∞ndeksi yok sayƒ±p yeniden sƒ±fƒ±rdan indeks olu≈üturur (varsayƒ±lan False).

``keys:`` Her DataFrame veya Series i√ßin bir seviye ekler.

In [136]:
dataset1 = {
    "A": ["A1","A2","A3","A4"],
    "B":["B1","B2","B3","B4"],
    "C":["C1","C2","C3","C4"],
}

In [137]:
dataset2 = {
    "A": ["A5","A6","A7","A8"],
    "B":["B5","B6","B7","B8"],
    "C":["C5","C6","C7","C8"],
}

In [138]:
df1 = pd.DataFrame(dataset1, index = [1,2,3,4])
df2 = pd.DataFrame(dataset2, index = [5,6,7,8])

In [139]:
df1

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4

In [140]:
df2

    A   B   C
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [141]:
pd.concat([df1,df2]) #objs = df1,df2

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [142]:
result = pd.concat([df1,df2],axis = 1) #S√ºtunlarƒ± birle≈ütirince NaN deƒüerler √ßƒ±kacaktƒ±r.
result

     A    B    C    A    B    C
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN
3   A3   B3   C3  NaN  NaN  NaN
4   A4   B4   C4  NaN  NaN  NaN
5  NaN  NaN  NaN   A5   B5   C5
6  NaN  NaN  NaN   A6   B6   C6
7  NaN  NaN  NaN   A7   B7   C7
8  NaN  NaN  NaN   A8   B8   C8

result_filled = result.fillna(0) #NaN deƒüerlerini dolduralƒ±m.
result_filled

### ‚úÖMERGE

Pandas'ta merge, "***iki ya da daha fazla veri √ßer√ßevesini (DataFrame) birle≈ütirmek i√ßin kullanƒ±lan g√º√ßl√º bir fonksiyondur.***"

``SQL'deki JOIN i≈ülemlerine √ßok benzer ≈üekilde √ßalƒ±≈üƒ±r.`` 

‚û°Ô∏èƒ∞ki tabloyu ortak bir s√ºtun ya da indeks √ºzerinden birle≈ütirir.‚¨ÖÔ∏è

üëÄüëÄ``Temel Kullanƒ±mƒ±``

**ƒ∞ki DataFrame'i birle≈ütirir.**

***Ortak s√ºtunlara veya anahtar deƒüerlerine dayanƒ±r.***

üìåFarklƒ± t√ºrlerde birle≈ütirme y√∂ntemleri sunar:

inner (kesi≈üim)

outer (birle≈üim)

left (soldan birle≈ütirme)

right (saƒüdan birle≈ütirme)

In [147]:
dataset1 = {
    "A" : ["A1","A2","A3"],
    "B" : ["B1","B2","B3"],
    "anahtar" : ["K1","K2","K3"]
}

In [148]:
df1 = pd.DataFrame(dataset1,index = [1,2,3])

In [149]:
df1

    A   B anahtar
1  A1  B1      K1
2  A2  B2      K2
3  A3  B3      K3

In [150]:
dataset2 = {
    "X" : ["X1","X2","X3","X4"],
    "Y" : ["Y1","Y2","Y3","Y4"],
    "anahtar" : ["K1","K2","K5","K4"]
}

In [151]:
df2 = pd.DataFrame(dataset2 , index =[1,2,3,4])

In [152]:
df2

    X   Y anahtar
1  X1  Y1      K1
2  X2  Y2      K2
3  X3  Y3      K5
4  X4  Y4      K4

In [153]:
result3 = pd.merge(df1,df2, how = "inner" , on = "anahtar")

In [154]:
result3

    A   B anahtar   X   Y
0  A1  B1      K1  X1  Y1
1  A2  B2      K2  X2  Y2

### ‚úÖJOIN

JOIN i≈ülemi, ````bir veritabanƒ±nda veya veri analizinde iki veya daha fazla tabloyu birle≈ütirmek i√ßin kullanƒ±lan bir y√∂ntemdir``. 

Python'da √∂zellikle pandas k√ºt√ºphanesi ile merge fonksiyonu kullanƒ±larak ger√ßekle≈ütirilir.

***JOIN T√ºrleri***

``INNER JOIN``
ƒ∞ki tablodaki ortak alanlara g√∂re birle≈ütirir. Sadece her iki tablonun kesi≈üiminde olan verileri alƒ±r.

``LEFT JOIN``
Sol tablodaki t√ºm verileri alƒ±r ve saƒü tabloyla e≈üle≈üen deƒüerleri getirir. E≈üle≈ümeyen saƒü tablodaki s√ºtunlar NaN olur.

``RIGHT JOIN``
Saƒü tablodaki t√ºm verileri alƒ±r ve sol tabloyla e≈üle≈üen deƒüerleri getirir. E≈üle≈ümeyen sol tablodaki s√ºtunlar NaN olur.

``OUTER JOIN``
Her iki tablodaki t√ºm verileri alƒ±r. Ortak olmayan alanlarda eksik veriler NaN olarak g√∂r√ºn√ºr.

In [157]:
dataset3 = {
    "A" : ["A1","A2","A3","A4"],
    "B" : ["B1","B2","B3","B4"],
}
dataset4 = {
    "X" : ["X1","X2","X3"],
    "Y" : ["Y1","Y2","Y3"],
    
}

In [158]:
df3 = pd.DataFrame(dataset3, index = [1,2,3,4])
df4 = pd.DataFrame(dataset4, index = [1,2,3])

In [159]:
df3

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [160]:
df4

    X   Y
1  X1  Y1
2  X2  Y2
3  X3  Y3

In [161]:
df3.join(df4) #df4 deƒüerleri df3 deƒüerlerinden fazla old. i√ßin eksikler NaN olacak.

    A   B    X    Y
1  A1  B1   X1   Y1
2  A2  B2   X2   Y2
3  A3  B3   X3   Y3
4  A4  B4  NaN  NaN

In [162]:
df4.join(df3) #Df4 deƒüerleri df3 deƒüerlerinden az old. i√ßin eksik olmayacaktƒ±r(df3'e g√∂re katƒ±lƒ±m yapƒ±lacak)

    X   Y   A   B
1  X1  Y1  A1  B1
2  X2  Y2  A2  B2
3  X3  Y3  A3  B3

__________________

In [187]:
# √ñrnek Veri
df5 = pd.DataFrame({
    'ID': [1, 2, 3],
    'Ad': ['Ali', 'Ay≈üe', 'Mehmet']
})

df6 = pd.DataFrame({
    'ID': [2, 3, 4],
    'B√∂l√ºm': ['Matematik', 'Fizik', 'Kimya']
})

# 1. INNER JOIN
inner_join = pd.merge(df5, df6, on='ID', how='inner')
print("INNER JOIN:\n", inner_join)

# 2. LEFT JOIN
left_join = pd.merge(df5, df6, on='ID', how='left')
print("\nLEFT JOIN:\n", left_join)

# 3. RIGHT JOIN
right_join = pd.merge(df5, df6, on='ID', how='right')
print("\nRIGHT JOIN:\n", right_join)

# 4. OUTER JOIN
outer_join = pd.merge(df5, df6, on='ID', how='outer')
print("\nOUTER JOIN:\n", outer_join)

INNER JOIN:
    ID      Ad      B√∂l√ºm
0   2    Ay≈üe  Matematik
1   3  Mehmet      Fizik

LEFT JOIN:
    ID      Ad      B√∂l√ºm
0   1     Ali        NaN
1   2    Ay≈üe  Matematik
2   3  Mehmet      Fizik

RIGHT JOIN:
    ID      Ad      B√∂l√ºm
0   2    Ay≈üe  Matematik
1   3  Mehmet      Fizik
2   4     NaN      Kimya

OUTER JOIN:
    ID      Ad      B√∂l√ºm
0   1     Ali        NaN
1   2    Ay≈üe  Matematik
2   3  Mehmet      Fizik
3   4     NaN      Kimya